"""
Задайте список из нескольких чисел. Напишите программу, 
которая найдёт сумму элементов списка, стоящих на нечётной позиции.

Пример:

- [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
"""

# my_list = [2, 3, 5, 9, 3]
# i = 0
# s = 0
# for i in range(0, len(my_list), 2):
#     i = i + 1
#     # print(my_list[i])
#     s = s + my_list[i]
#     print(s)  """не понимаю почему выводится значение 3 и почему ошибка line 16?"""




"""
    Напишите программу, которая найдёт произведение пар чисел списка. 
    Парой считаем первый и последний элемент, второй и предпоследний и т.д.

Пример:

- [2, 3, 4, 5, 6] => [12, 15, 16];
- [2, 3, 5, 6] => [12, 15]
"""

# my_list = [2, 3, 4, 5, 6]
# a = my_list[::len(my_list)-1]
# def multiply(a): return a
# print(multiply(a))  """это пробный вариант, не работает"""

# b = []
# my_list = [2, 3, 4, 5, 6]
# for i in range(len(my_list) // 2 + 1):
#     b.append(my_list[i] * my_list[len(my_list)-1-i])
#     print(b)



'''
Задайте список из вещественных чисел. Напишите программу, которая найдёт 
разницу между максимальным и минимальным значением дробной части элементов.

Пример:

- [1.1, 1.2, 3.1, 5, 10.01] => 0.19
'''

# my_list = [1.1, 1.2, 3.1, 5, 10.01]
# b = []
# for i in my_list:
#     i = round((i % 1), 2)
#     if i != 0:
#      b.append(i)
#      print(b)
#      print(max(b)-min(b))



'''
Напишите программу, которая будет преобразовывать десятичное число в двоичное.

Пример:

- 45 -> 101101
- 3 -> 11
- 2 -> 10
'''

# num = int(input('введите число '))
# print(bin(num))

# num = int(input('введите число '))
# a = ''
# while num > 0:
#     a = str(num % 2) + a
#     num = num // 2
#     print(a)


"""
Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.

Пример:

- для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]
"""

n = int(input('введите число '))
nfib = [-1, -2]
for i in range(2, n-1):
    nfib.append(nfib[i-2] + nfib[i-1])
a = list(reversed(nfib))
print(a)

fib = [0, 1]
for i in range(2, n+1):
    fib.append(fib[i-2] + fib[i-1])
print(fib)
"""как соединить?"""
