"""
Есть два файла: в одном хранятся ФИО пользователей сайта, а в другом — данные об их хобби.
Известно, что при хранении данных используется принцип: одна строка — один пользователь.
Написать код, загружающий данные из обоих файлов и формирующий из них словарь: ключи — ФИО, значения — данные о хобби.
*Сохранить словарь в файл users_hobby.txt. Фрагмент файла с данными о пользователях (users.txt):
Иванов Иван Иванович Петров Петр Петрович Фрагмент файла с данными о хобби (hobby.txt):
скалолазание, охота горные лыжи
"""
# names = ["Иванов Иван Иванович", "Петров Петр Петрович"]
# with open('users.txt', 'w') as mf:
#     for i in names:
#         mf.write(i + '\n')
#
# hobby = ["скалолазание", "охота"]
# with open('hobby.txt', 'w') as mf2:
#     for i in hobby:
#         mf2.write(i + '\n')
#
# user_hobby = {}
# nam = open('users.txt', 'r')
# hob = open('hobby.txt', 'r')
# for n, h in zip(nam, hob):
#     user_hobby[n.replace('\n', '')] = h
# print(user_hobby)
#
# with open('users_hobby.txt', 'w') as md:
#     for key, val in user_hobby.items():
#         md.writelines(f'{key}: {val}')


"""
Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
"""

# num = int(input('введите число '))
# a = []
# for i in range(1, num+1):
#     if num % i == 0:
#         a.append(i)
# print(a)

"""
Задайте последовательность чисел. Напишите программу, которая выведет список 
неповторяющихся элементов исходной последовательности.
"""

# import random
# """импортируем модуль рандом"""
# my_list = [random.randint(1, 10) for i in range(10)]
# """создаем последовательность случайных целых чисел от 1 до 10 для 10 элементов"""
# print(my_list)
# print(set(my_list))
# """с помощью set исключаются повторения и составляется последовательность по возрастанию"""
#
# new_list = []
# """создаем пустой лист"""
# for num in my_list:
#     if num not in new_list:
#         new_list.append(num)
# """с помощью цикла создаем условие: если число не входит в состав my_list, то добавляем в new_list """
# print(new_list)

"""
*Задана натуральная степень k. 
Сформировать случайным образом список коэффициентов (значения от 0 до 100) многочлена 
и записать в файл многочлен степени k. Пример: k=2 => 2x² + 4x + 5 = 0 или x² + 5 = 0 или 10x² = 0
"""

# from random import randint, sample
# """ из встроенного модуля рандом импортируем функции randint - задает диапазон случайных чисел,
# sample - для указания количества элементов выборки"""
#
# max_degree = randint(2, 5)
# """ задаем случайную степень от 2 до 5"""
# print(max_degree)
# # def coeffs_list(d):
# #     coeffs = [randint(0, 10) for i in range(max_degree + 1)]
# """ не понимаю зачем здесь эта функция..."""
# coeffs = sample(range(9), max_degree)
# """задаем список случайных коэффициентов от 0 до 9 с выводом чисел в количестве заданном max_degree"""
#
# while coeffs[0] == 0:
#     coeffs[0] = randint(1, 10)
# """проверка на 0"""
# print('coeffs', coeffs)
#
# poly = ''
# p = max_degree
# for i in coeffs:
#     poly += f'{i}x^{p-1} + '
#     p = p-1
# """задаем многочлен из списка коэффициентов в степени р-1"""
# poly += '= 0'
# poly = poly.replace('^1', '')
# """ заменяем возведение в степень 1 пустой строкой"""
# poly = poly.replace('x^0 +', '')
# """ заменяем возведение коэффициента в степень 0 пустой строкой"""
#
# print(poly)



