""" 
Напишите программу, которая принимает на вход вещественное 
число и показывает сумму его цифр.

Пример:

- 6782 -> 23
- 0,56 -> 11
"""

# n = int(input('введите число '))
# s = 0

# while n > 0:
#     i = n % 10
#     s = s + i
#     n = n // 10
 
# print("Сумма:", s)

"""
Напишите программу, которая принимает на вход число N 
и выдает набор произведений чисел от 1 до N.

Пример:

- пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)
"""

# num1 = int(input('введите число '))
# my_list = []
# s = 1
# for i in range(1, num1+1):
#  s = s * i
#  my_list.append(s)
# print(my_list)


"""
Задайте список из n чисел последовательности (1+1/n)**n и выведите на экран их сумму.

Пример:

Для n = 6: {1: 2, 2: 2,25, 3: 2,37, 4: 2,44, 5: 2,49, 6: 2,52}

"""

# num1 = int(input('введите n '))
# my_list = {}
# s = 0
# for i in range(1, num1+1):
#    my_list[i] = round((1+1/i)**i, 2)
#    s = s + my_list[i]
#    print(my_list)
#    print(s)

"""
17. Задайте список из N элементов, заполненных числами из промежутка [-N, N]. 
Найдите произведение элементов на введенных пользователем позициях.
"""

n = int(input('введите n '))
x = int(input('введите x '))
y = int(input('введите y '))
my_list = []
for i in range(-n, n+1):
     my_list.append(i)
     print(my_list, x*y)
   